jandegr/esp8266_p1meter_belgium/esp8266_p1meter_belgium/esp_p1meter_belgium.cpp
//#include <FS.h>
#include <arduino.h>
#include <EEPROM.h>
#include <DNSServer.h>
#if defined(ESP8266)
#include <ESP8266WiFi.h>
HardwareSerial receivingSerial = Serial;
#endif
#if defined(ESP32)
#include <Wifi.h>
HardwareSerial receivingSerial = Serial2;
#define RXD2 15
#define TXD2 14
#endif
#include <Ticker.h>
#include <WiFiManager.h>
#if defined(ESP8266)
#include <ESP8266mDNS.h>
#endif
#if defined(ESP32)
#include <ESPmDNS.h>
#endif
#include <WiFiUdp.h>
#include <ArduinoOTA.h>
#include <PubSubClient.h>
#include <time.h>

// * Include settings
#include "settings.h"

// * Initiate led blinker library
Ticker ticker;

// * Initiate WIFI client
WiFiClient espClient;

// * Initiate MQTT client
PubSubClient mqtt_client(espClient);

struct tm testTimeInfo;
struct tm testTimeInfoLast;
float kwartierVermogen = 0;
float kwartierVermogenMaand = 0;
float kwartierVermogenVorigeMaand = 0;
float tellerstand = 0;
bool shouldSaveConfig = false;
int startup = 2;
// * Set during CRC checking
unsigned int currentCRC = 0;
// * Set to store received telegram
char telegram[P1_MAXLINELENGTH];

// **********************************
// * Ticker (System LED Blinker)    *
// **********************************

// * Blink on-board Led
void tick()
{
    // * Toggle state
    int state = digitalRead(LED_BUILTIN); // * Get the current state of GPIO1 pin
    digitalWrite(LED_BUILTIN, !state);    // * Set pin to the opposite state
}

// **********************************
// * WIFI                           *
// **********************************

// * Gets called when WiFiManager enters configuration mode
void configModeCallback(WiFiManager *myWiFiManager)
{
    Serial.println(F("Entered config mode"));
    Serial.println(WiFi.softAPIP());

    // * If you used auto generated SSID, print it
    Serial.println(myWiFiManager->getConfigPortalSSID());

    // * Entered config mode, make led toggle faster
    ticker.attach(0.2, tick);
}

// **********************************
// * MQTT                           *
// **********************************

// * Send a message to a broker topic
void send_mqtt_message(const char *topic, char *payload)
{
    Serial.printf("MQTT Outgoing on %s: ", topic);
    Serial.println(payload);

    bool result = mqtt_client.publish(topic, payload, false);

    if (!result)
    {
        Serial.printf("MQTT publish to topic %s failed\n", topic);
    }
}

// * Reconnect to MQTT server and subscribe to in and out topics
bool mqtt_reconnect()
{
    // * Loop until we're reconnected
    int MQTT_RECONNECT_RETRIES = 0;

    while (!mqtt_client.connected() && MQTT_RECONNECT_RETRIES < MQTT_MAX_RECONNECT_TRIES)
    {
        MQTT_RECONNECT_RETRIES++;
        Serial.printf("MQTT connection attempt %d / %d ...\n", MQTT_RECONNECT_RETRIES, MQTT_MAX_RECONNECT_TRIES);

        // * Attempt to connect
        if (mqtt_client.connect(HOSTNAME, MQTT_USER, MQTT_PASS))
        {
            Serial.println(F("MQTT connected!"));

            // * Once connected, publish an announcement...
            char *message = new char[16 + strlen(HOSTNAME) + 1];
            strcpy(message, "p1 meter alive: ");
            strcat(message, HOSTNAME);
            mqtt_client.publish("hass/status", message);

            Serial.printf("MQTT root topic: %s\n", MQTT_ROOT_TOPIC);
        }
        else
        {
            Serial.print(F("MQTT Connection failed: rc="));
            Serial.println(mqtt_client.state());
            Serial.println(F(" Retrying in 5 seconds"));
            Serial.println("");

            // * Wait 5 seconds before retrying
            delay(5000);
        }
    }

    if (MQTT_RECONNECT_RETRIES >= MQTT_MAX_RECONNECT_TRIES)
    {
        Serial.printf("*** MQTT connection failed, giving up after %d tries ...\n", MQTT_RECONNECT_RETRIES);
        return false;
    }

    return true;
}

void send_metric(String name, long metric)
{
    // Serial.print(F("Sending metric to broker: "));
    // Serial.print(name);
    // Serial.print(F("="));
    // Serial.println(metric);

    ///////////////////////////////

    // char output[10];
    // ltoa(metric, output, sizeof(output));

    // String topic = String(MQTT_ROOT_TOPIC) + "/" + name;
    // send_mqtt_message(topic.c_str(), output);
}

void send_data_to_broker()
{
    send_metric("consumption_low_tarif", consumptionLowTarif);
    send_metric("consumption_high_tarif", consumptionHighTarif);
    send_metric("injected_low_tarif", injectedLowTarif);
    send_metric("injected_high_tarif", injectedHighTarif);
    send_metric("actual_consumption", consumptionPower);
    send_metric("actual_injection", injectionPower);

    send_metric("l1_instant_power_usage", L1ConsumptionPower);
    send_metric("l2_instant_power_usage", L2ConsumptionPower);
    send_metric("l3_instant_power_usage", L3ConsumptionPower);
    send_metric("l1_current", L1Current);
    send_metric("l2_current", L2Current);
    send_metric("l3_current", L3Current);
    send_metric("l1_voltage", L1Voltage);
    send_metric("l2_voltage", L2Voltage);
    send_metric("l3_voltage", L3Voltage);

    send_metric("gas_meter_m3", GAS_METER_M3);

    send_metric("actual_tarif_group", actualTarif);
    send_metric("short_power_outages", SHORT_POWER_OUTAGES);
    send_metric("long_power_outages", LONG_POWER_OUTAGES);
    send_metric("short_power_drops", SHORT_POWER_DROPS);
    send_metric("short_power_peaks", SHORT_POWER_PEAKS);

    send_metric("kwartiervermogen", kwartierVermogen);
    send_metric("kwartiervermogen_maand0", kwartierVermogenMaand);
}

// **********************************
// * P1                             *
// **********************************

unsigned int CRC16(unsigned int crc, unsigned char *buf, int len)
{
    for (int pos = 0; pos < len; pos++)
    {
        crc ^= (unsigned int)buf[pos]; // * XOR byte into least sig. byte of crc
                                       // * Loop over each bit
        for (int i = 8; i != 0; i--)
        {
            // * If the LSB is set
            if ((crc & 0x0001) != 0)
            {
                // * Shift right and XOR 0xA001
                crc >>= 1;
                crc ^= 0xA001;
            }
            // * Else LSB is not set
            else
                // * Just shift right
                crc >>= 1;
        }
    }
    return crc;
}

