jandegr/esp8266_p1meter_belgium/esp8266_p1meter_belgium/esp_p1meter_belgium.cpp
bool isNumber(char *res, int len)
{
    for (int i = 0; i < len; i++)
    {
        if (((res[i] < '0') || (res[i] > '9')) && (res[i] != '.' && res[i] != 0))
            return false;
    }
    return true;
}

int FindCharInArrayRev(char array[], char c, int len)
{
    for (int i = len - 1; i >= 0; i--)
    {
        if (array[i] == c)
            return i;
    }
    return -1;
}

long getValue(char *buffer, int maxlen, char startchar, char endchar)
{
    int s = FindCharInArrayRev(buffer, startchar, maxlen - 2);
    int l = FindCharInArrayRev(buffer, endchar, maxlen - 2) - s - 1;

    char res[16];
    memset(res, 0, sizeof(res));

    if (!((l + s + 1) > s))
    {
        Serial.println("malformed input");
        return 0;
    }

    if (strncpy(res, buffer + s + 1, l))
    {
        if (endchar == '*')
        {
            if (isNumber(res, l))
                // * Lazy convert float to long
                return (1000 * atof(res));
        }
        else if (endchar == ')')
        {
            if (isNumber(res, l))
                return atof(res);
        }
    }
    return 0;
}

bool decodeTelegram(int len)
{
    int startChar = FindCharInArrayRev(telegram, '/', len);
    int endChar = FindCharInArrayRev(telegram, '!', len);
    bool validCRCFound = false;

    for (int cnt = 0; cnt < len; cnt++)
    {
        Serial.print(telegram[cnt]);
    }

    if (startChar >= 0)
    {
        // * Start found. Reset CRC calculation
        currentCRC = CRC16(0x0000, (unsigned char *)telegram + startChar, len - startChar);
    }
    else if (endChar >= 0)
    {
        char messageCRC[5];
        memset(messageCRC, 0, sizeof(messageCRC));
        // * Add to crc calc
        currentCRC = CRC16(currentCRC, (unsigned char *)telegram + endChar, 1);

        strncpy(messageCRC, telegram + endChar + 1, 4);
        validCRCFound = (strtol(messageCRC, NULL, 16) == currentCRC);
        // Serial.print("CRC = ");
        // Serial.println(currentCRC, HEX);

        if (!validCRCFound)
            //    Serial.println(F("CRC Valid!"));
            // else
            Serial.println(F("CRC Invalid!"));

        currentCRC = 0;
    }
    else
    {
        currentCRC = CRC16(currentCRC, (unsigned char *)telegram, len);
    }

    // L1, L2 en L3 power injectie ontbreken (1-0:22.7.0) enzovoort

    if (strncmp(telegram, "1", 1) == 0)
    {
        // 1-0:1.8.1(000992.992*kWh)
        // 1-0:1.8.1 = Elektriciteit verbruik laag tarief (DSMR v5.0)
        if (strncmp(telegram, "1-0:1.8.2", strlen("1-0:1.8.2")) == 0)
        {
            consumptionLowTarif = getValue(telegram, len, '(', '*');
        }
        else

            // 1-0:1.8.2(000560.157*kWh)
            // 1-0:1.8.2 = Elektriciteit verbruik hoog tarief (DSMR v5.0)
            if (strncmp(telegram, "1-0:1.8.1", strlen("1-0:1.8.1")) == 0)
            {
                consumptionHighTarif = getValue(telegram, len, '(', '*');
            }
            else

                // 1-0:2.8.1(000560.157*kWh)
                // 1-0:2.8.1 = Elektriciteit injectie laag tarief (DSMR v5.0)
                if (strncmp(telegram, "1-0:2.8.2", strlen("1-0:2.8.2")) == 0)
                {
                    injectedLowTarif = getValue(telegram, len, '(', '*');
                }
                else

                    // 1-0:2.8.2(000560.157*kWh)
                    // 1-0:2.8.2 = Elektriciteit injectie hoog tarief (DSMR v5.0)
                    if (strncmp(telegram, "1-0:2.8.1", strlen("1-0:2.8.1")) == 0)
                    {
                        injectedHighTarif = getValue(telegram, len, '(', '*');
                    }
                    else

                        // 1-0:1.7.0(00.424*kW) Actueel verbruik
                        // 1-0:1.7.x = Electricity consumption actual usage (DSMR v5.0)
                        if (strncmp(telegram, "1-0:1.7.0", strlen("1-0:1.7.0")) == 0)
                        {
                            consumptionPower = getValue(telegram, len, '(', '*');
                        }
                        else

                            // 1-0:2.7.0(00.000*kW) Actuele injectie in 1 Watt resolution
                            if (strncmp(telegram, "1-0:2.7.0", strlen("1-0:2.7.0")) == 0)
                            {
                                injectionPower = getValue(telegram, len, '(', '*');
                            }
                            else

                                // 1-0:21.7.0(00.378*kW)
                                // 1-0:21.7.0 = Instantaan vermogen Elektriciteit levering L1
                                if (strncmp(telegram, "1-0:21.7.0", strlen("1-0:21.7.0")) == 0)
                                {
                                    L1ConsumptionPower = getValue(telegram, len, '(', '*');
                                }
                                else

                                    // 1-0:41.7.0(00.378*kW)
                                    // 1-0:41.7.0 = Instantaan vermogen Elektriciteit levering L2
                                    if (strncmp(telegram, "1-0:41.7.0", strlen("1-0:41.7.0")) == 0)
                                    {
                                        L2ConsumptionPower = getValue(telegram, len, '(', '*');
                                    }
                                    else

                                        // 1-0:61.7.0(00.378*kW)
                                        // 1-0:61.7.0 = Instantaan vermogen Elektriciteit levering L3
                                        if (strncmp(telegram, "1-0:61.7.0", strlen("1-0:61.7.0")) == 0)
                                        {
                                            L3ConsumptionPower = getValue(telegram, len, '(', '*');
                                        }
                                        else

                                            // 1-0:31.7.0(002*A)
                                            // 1-0:31.7.0 = stroom Elektriciteit L1
                                            if (strncmp(telegram, "1-0:31.7.0", strlen("1-0:31.7.0")) == 0)
                                            {
                                                L1Current = getValue(telegram, len, '(', '*');
                                            }
                                            else
                                                // 1-0:51.7.0(002*A)
                                                // 1-0:51.7.0 = stroom Elektriciteit L2
                                                if (strncmp(telegram, "1-0:51.7.0", strlen("1-0:51.7.0")) == 0)
                                                {
                                                    L2Current = getValue(telegram, len, '(', '*');
                                                }
                                                else
                                                    // 1-0:71.7.0(002*A)
                                                    // 1-0:71.7.0 = stroom Elektriciteit L3
                                                    if (strncmp(telegram, "1-0:71.7.0", strlen("1-0:71.7.0")) == 0)
                                                    {
                                                        L3Current = getValue(telegram, len, '(', '*');
                                                    }
                                                    else

                                                        // 1-0:32.7.0(232.0*V)
                                                        // 1-0:32.7.0 = Voltage L1
                                                        if (strncmp(telegram, "1-0:32.7.0", strlen("1-0:32.7.0")) == 0)
                                                        {
                                                            L1Voltage = getValue(telegram, len, '(', '*');
                                                        }
                                                        else
                                                            // 1-0:52.7.0(232.0*V)
                                                            // 1-0:52.7.0 = Voltage L2
                                                            if (strncmp(telegram, "1-0:52.7.0", strlen("1-0:52.7.0")) == 0)
                                                            {
                                                                L2Voltage = getValue(telegram, len, '(', '*');
                                                            }
                                                            else
                                                                // 1-0:72.7.0(232.0*V)
                                                                // 1-0:72.7.0 = Voltage L3
                                                                if (strncmp(telegram, "1-0:72.7.0", strlen("1-0:72.7.0")) == 0)
                                                                {
                                                                    L3Voltage = getValue(telegram, len, '(', '*');
                                                                }
                                                                else

                                                                    // 1-0:32.32.0(00000)
                                                                    // 1-0:32.32.0 = Aantal korte spanningsdalingen Elektriciteit in fase 1
                                                                    if (strncmp(telegram, "1-0:32.32.0", strlen("1-0:32.32.0")) == 0)
                                                                    {
                                                                        SHORT_POWER_DROPS = getValue(telegram, len, '(', ')');
                                                                    }
                                                                    else

                                                                        // 1-0:32.36.0(00000)
                                                                        // 1-0:32.36.0 = Aantal korte spanningsstijgingen Elektriciteit in fase 1
                                                                        if (strncmp(telegram, "1-0:32.36.0", strlen("1-0:32.36.0")) == 0)
                                                                        {
                                                                            SHORT_POWER_PEAKS = getValue(telegram, len, '(', ')');
                                                                        }
    }
    else if (strncmp(telegram, "0", 1) == 0)
    {

