jandegr/esp8266_p1meter_belgium/esp8266_p1meter_belgium/esp_p1meter_belgium.cpp
        // 0-1:24.2.1(150531200000S)(00811.923*m3)
        // 0-1:24.2.1 = Gas (DSMR v5.0)
        if (strncmp(telegram, "0-1:24.2.3", strlen("0-1:24.2.3")) == 0)
        {
            GAS_METER_M3 = getValue(telegram, len, '(', '*');
        }
        else

            // 0-0:96.14.0(0001)
            // 0-0:96.14.0 = Actual Tarif
            if (strncmp(telegram, "0-0:96.14.0", strlen("0-0:96.14.0")) == 0)
            {
                actualTarif = getValue(telegram, len, '(', ')');
            }
            else

                // 0-0:96.7.21(00003)
                // 0-0:96.7.21 = Aantal onderbrekingen Elektriciteit
                if (strncmp(telegram, "0-0:96.7.21", strlen("0-0:96.7.21")) == 0)
                {
                    SHORT_POWER_OUTAGES = getValue(telegram, len, '(', ')');
                }
                else

                    // 0-0:96.7.9(00001)
                    // 0-0:96.7.9 = Aantal lange onderbrekingen Elektriciteit
                    if (strncmp(telegram, "0-0:96.7.9", strlen("0-0:96.7.9")) == 0)
                    {
                        LONG_POWER_OUTAGES = getValue(telegram, len, '(', ')');
                    }
                    // 0-0:1.0.0(220616152735S)
                    // TST
                    else if ((strncmp(telegram, "0-0:1.0.0", strlen("0-0:1.0.0")) == 0) && (len >= 24))
                    {
                        char temp[] = {telegram[10], telegram[11], 0};
                        testTimeInfo.tm_year = 100 + atoi(temp); // telt vanaf 1900
                        strncpy(temp, &telegram[12], 2);
                        testTimeInfo.tm_mon = atoi(temp);
                        strncpy(temp, &telegram[14], 2);
                        testTimeInfo.tm_mday = atoi(temp);
                        strncpy(temp, &telegram[16], 2);
                        testTimeInfo.tm_hour = atoi(temp);
                        strncpy(temp, &telegram[18], 2);
                        testTimeInfo.tm_min = atoi(temp);
                        strncpy(temp, &telegram[20], 2);
                        testTimeInfo.tm_sec = atoi(temp);
                        testTimeInfo.tm_isdst = (telegram[22] == 'S');
                        // https://randomnerdtutorials.com/esp32-date-time-ntp-client-server-arduino/
                        // Sunday, November 01 2019 09:03:45
                        // Serial.println(&testTimeInfo, "%A, %B %d %Y %H:%M:%S"); // struct tm testTimeInfo is Posix !!
                        // November 01 2019 09:03:45
                        // Serial.println(&testTimeInfo, "%B %d %Y %H:%M:%S");
                    }
    }

    return validCRCFound;
}

int getKwartier(tm timeInfo) // nog niet goed, herbegint bij 0 volgende dag en ziet dat niet meer als een nieuw kwartier
{
    int kwartier;
    kwartier = timeInfo.tm_hour * 4;
    kwartier = kwartier + ((timeInfo.tm_mday -1)* 96);
    kwartier = kwartier + (timeInfo.tm_min / 15);
    Serial.print("kwartier = ");
    Serial.println(kwartier);
    return kwartier;
}


void processKwartier()
{
    int deltaKwartier = getKwartier(testTimeInfo) > getKwartier(testTimeInfoLast);

    // eerste poging om nieuwe maand te verwerken
    if (testTimeInfo.tm_mday < testTimeInfoLast.tm_mday)
    {
       kwartierVermogen = ( consumptionHighTarif + consumptionLowTarif - tellerstand) * 4;
       if (kwartierVermogen > kwartierVermogenMaand)
          {
            kwartierVermogenMaand = kwartierVermogen;
          } 
       kwartierVermogenVorigeMaand = kwartierVermogenMaand;
       kwartierVermogenMaand = 0;
       tellerstand = consumptionHighTarif + consumptionLowTarif; // tellerstand aan begin van het kwartier
       kwartierVermogen = (float)consumptionPower;
       memcpy(&testTimeInfoLast, &testTimeInfo, sizeof(testTimeInfo));
       Serial.println("nieuwe maand begonnen");
    }

    if (startup > 1 && deltaKwartier > 0)
    {
        memcpy(&testTimeInfoLast, &testTimeInfo, sizeof(testTimeInfo));
        // onderstaande is misschien niet goed ??
        tellerstand = consumptionHighTarif + consumptionLowTarif;

        startup = 1;
    }
    else if (deltaKwartier > 0)
    {
        if (startup)
        {
            startup = 0;
            tellerstand = consumptionHighTarif + consumptionLowTarif;
        } else

        { // mag wel niet uitgevoerd worden bij aanvang nieuwe maand
          kwartierVermogen = ( consumptionHighTarif + consumptionLowTarif - tellerstand) * 4;
          tellerstand = consumptionHighTarif + consumptionLowTarif; // tellerstand aan begin van het kwartier
          if (kwartierVermogen > kwartierVermogenMaand)
          {
            kwartierVermogenMaand = kwartierVermogen;
            //kwartierVermogen = consumptionPower; 
          } 
        }
          
          memcpy(&testTimeInfoLast, &testTimeInfo, sizeof(testTimeInfo));
    }
    else 
    {
        // nu lopend kwartiervermogen bepalen
        // onderstaande nog verrekenen met verstreken tijd
        float secondenverstreken;
        secondenverstreken = (testTimeInfo.tm_min % 15) * 60;
        secondenverstreken = secondenverstreken + testTimeInfo.tm_sec;
        if (!startup) 
        {
          kwartierVermogen = ( consumptionHighTarif + consumptionLowTarif - tellerstand ) / (secondenverstreken / 3600);
        }
        Serial.print("secondenverstreken = ");
        Serial.println(secondenverstreken);
    }
    
    Serial.print("kwartiervermogen vorige maand = ");
    Serial.println(kwartierVermogenVorigeMaand);
    Serial.print("kwartiervermogen maand = ");
    Serial.println(kwartierVermogenMaand);
    Serial.print("kwartiervermogen = ");
    Serial.println(kwartierVermogen);
    //Serial.print("tellerstand = ");
    //Serial.println(tellerstand);
}

bool processLine(int len)
{
    telegram[len] = '\n';
    telegram[len + 1] = 0;
    yield();

    return (decodeTelegram(len + 1));
}

void readP1Hardwareserial()
{
    if (receivingSerial.available())
    {
        memset(telegram, 0, sizeof(telegram));

        while (receivingSerial.available())
        {
#if defined(ESP8266)
            ESP.wdtDisable();
#endif
            int len = receivingSerial.readBytesUntil('\n', telegram, P1_MAXLINELENGTH);
#if defined(ESP8266)
            ESP.wdtEnable(1);
#endif

            if (processLine(len))
            {
                processKwartier();
                send_data_to_broker();
                LAST_UPDATE_SENT = millis();
                // Serial.println("send data to broker");
            }
        }
    }
}

// **********************************
// * EEPROM helpers                 *
// **********************************

String read_eeprom(int offset, int len)
{
    Serial.print(F("read_eeprom()"));

