jandegr/esp8266_p1meter_belgium/esp8266_p1meter_belgium/esp_p1meter_belgium.cpp
    String res = "";
    for (int i = 0; i < len; ++i)
    {
        res += char(EEPROM.read(i + offset));
    }
    return res;
}

void write_eeprom(int offset, int len, String value)
{
    Serial.println(F("write_eeprom()"));
    for (int i = 0; i < len; ++i)
    {
        if ((unsigned)i < value.length())
        {
            EEPROM.write(i + offset, value[i]);
        }
        else
        {
            EEPROM.write(i + offset, 0);
        }
    }
}

// ******************************************
// * Callback for saving WIFI config        *
// ******************************************

// * Callback notifying us of the need to save config
void save_wifi_config_callback()
{
    Serial.println(F("Should save config"));
    shouldSaveConfig = true;
}

// **********************************
// * Setup OTA                      *
// **********************************

void setup_ota()
{
    Serial.println(F("Arduino OTA activated."));

    // * Port defaults to 8266
    ArduinoOTA.setPort(8266);

    // * Set hostname for OTA
    ArduinoOTA.setHostname(HOSTNAME);
    ArduinoOTA.setPassword(OTA_PASSWORD);

    ArduinoOTA.onStart([]()
                       { Serial.println(F("Arduino OTA: Start")); });

    ArduinoOTA.onEnd([]()
                     { Serial.println(F("Arduino OTA: End (Running reboot)")); });

    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total)
                          { Serial.printf("Arduino OTA Progress: %u%%\r", (progress / (total / 100))); });

    ArduinoOTA.onError([](ota_error_t error)
                       {
        Serial.printf("Arduino OTA Error[%u]: ", error);
        if (error == OTA_AUTH_ERROR)
            Serial.println(F("Arduino OTA: Auth Failed"));
        else if (error == OTA_BEGIN_ERROR)
            Serial.println(F("Arduino OTA: Begin Failed"));
        else if (error == OTA_CONNECT_ERROR)
            Serial.println(F("Arduino OTA: Connect Failed"));
        else if (error == OTA_RECEIVE_ERROR)
            Serial.println(F("Arduino OTA: Receive Failed"));
        else if (error == OTA_END_ERROR)
            Serial.println(F("Arduino OTA: End Failed")); });

    ArduinoOTA.begin();
    Serial.println(F("Arduino OTA finished"));
}

// **********************************
// * Setup MDNS discovery service   *
// **********************************

void setup_mdns()
{
    Serial.println(F("Starting MDNS responder service"));

    bool mdns_result = MDNS.begin(HOSTNAME);
    if (mdns_result)
    {
        MDNS.addService("http", "tcp", 80);
    }
}

// **********************************
// * Setup Main                     *
// **********************************

void setup()
{
    memset(&testTimeInfo, 0, sizeof(testTimeInfo));
    memset(&testTimeInfoLast, 0, sizeof(testTimeInfoLast));
    // * Configure EEPROM
    EEPROM.begin(512);

#if defined(ESP8266)
    // Serial port setup for ESP8266
    // Setup a hw serial connection for communication with the P1 meter and logging (not yet using inversion)
    Serial.begin(BAUD_RATE, SERIAL_8N1, SERIAL_FULL);
    Serial.println("");
    Serial.println("Swapping UART0 RX to inverted");
    Serial.flush();
    // Invert the RX serialport by setting a register value, this way the TX might continue normally allowing the arduino serial monitor to read printlns
    USC0(UART0) = USC0(UART0) | BIT(UCRXI);
    receivingSerial = Serial;
#endif

#if defined(ESP32)
    Serial.begin(BAUD_RATE1);
    Serial2.begin(BAUD_RATE, SERIAL_8N1, RXD2, TXD2, true); // INVERT
    receivingSerial = Serial2;
#endif

    Serial.println("Serial port is ready to recieve.");

    // * Set led pin as output
    pinMode(LED_BUILTIN, OUTPUT);

    // * Start ticker with 0.5 because we start in AP mode and try to connect
    ticker.attach(0.6, tick);

    // * Get MQTT Server settings
    String settings_available = read_eeprom(134, 1);

    if (settings_available == "1")
    {
        read_eeprom(0, 64).toCharArray(MQTT_HOST, 64);   // * 0-63
        read_eeprom(64, 6).toCharArray(MQTT_PORT, 6);    // * 64-69
        read_eeprom(70, 32).toCharArray(MQTT_USER, 32);  // * 70-101
        read_eeprom(102, 32).toCharArray(MQTT_PASS, 32); // * 102-133
    }

    WiFiManagerParameter CUSTOM_MQTT_HOST("host", "MQTT hostname", MQTT_HOST, 64);
    WiFiManagerParameter CUSTOM_MQTT_PORT("port", "MQTT port", MQTT_PORT, 6);
    WiFiManagerParameter CUSTOM_MQTT_USER("user", "MQTT user", MQTT_USER, 32);
    WiFiManagerParameter CUSTOM_MQTT_PASS("pass", "MQTT pass", MQTT_PASS, 32);

    // * WiFiManager local initialization. Once its business is done, there is no need to keep it around
    WiFiManager wifiManager;

    // * Reset settings - uncomment for testing
    // wifiManager.resetSettings();

    // * Set callback that gets called when connecting to previous WiFi fails, and enters Access Point mode
    wifiManager.setAPCallback(configModeCallback);

    // * Set timeout
    wifiManager.setConfigPortalTimeout(WIFI_TIMEOUT);

    // * Set save config callback
    wifiManager.setSaveConfigCallback(save_wifi_config_callback);

    // * Add all your parameters here
    // wifiManager.addParameter(&CUSTOM_MQTT_HOST);
    // wifiManager.addParameter(&CUSTOM_MQTT_PORT);
    // wifiManager.addParameter(&CUSTOM_MQTT_USER);
    // wifiManager.addParameter(&CUSTOM_MQTT_PASS);

    // * Fetches SSID and pass and tries to connect
    // * Reset when no connection after 10 seconds
    // if (!wifiManager.autoConnect())
    //{
    //    Serial.println(F("Failed to connect to WIFI and hit timeout"));

    // * Reset and try again, or maybe put it to deep sleep
    // ESP.reset();
    //    delay(WIFI_TIMEOUT);
    //}

    // * Read updated parameters
    // strcpy(MQTT_HOST, CUSTOM_MQTT_HOST.getValue());
    // strcpy(MQTT_PORT, CUSTOM_MQTT_PORT.getValue());
    // strcpy(MQTT_USER, CUSTOM_MQTT_USER.getValue());
    // strcpy(MQTT_PASS, CUSTOM_MQTT_PASS.getValue());

    // * Save the custom parameters to FS
    if (shouldSaveConfig)
    {
        Serial.println(F("Saving WiFiManager config"));

        write_eeprom(0, 64, MQTT_HOST);   // * 0-63
        write_eeprom(64, 6, MQTT_PORT);   // * 64-69
        write_eeprom(70, 32, MQTT_USER);  // * 70-101
        write_eeprom(102, 32, MQTT_PASS); // * 102-133
        write_eeprom(134, 1, "1");        // * 134 --> always "1"
        EEPROM.commit();
    }

    // * If you get here you have connected to the WiFi
    // Serial.println(F("Connected to WIFI..."));

    // * Keep LED on
    ticker.detach();
    digitalWrite(LED_BUILTIN, LOW);

    // * Configure OTA
    // setup_ota();

    // * Startup MDNS Service
    // setup_mdns();

    // * Setup MQTT
    // Serial.printf("MQTT connecting to: %s:%s\n", MQTT_HOST, MQTT_PORT);

    // mqtt_client.setServer(MQTT_HOST, atoi(MQTT_PORT));
}

// **********************************
// * Loop                           *
// **********************************

void loop()
{
    // ArduinoOTA.handle();
    long now = millis();

    // if (!mqtt_client.connected())
    //{
    //     if (now - LAST_RECONNECT_ATTEMPT > 5000)
    //     {
    //         LAST_RECONNECT_ATTEMPT = now;

    //        if (mqtt_reconnect())
    //        {
    //            LAST_RECONNECT_ATTEMPT = 0;
    //        }
    //    }
    //}
    // else
    //{
    //    mqtt_client.loop();
    //}

    if (now - LAST_UPDATE_SENT > UPDATE_INTERVAL)
    {
        digitalWrite(LED_BUILTIN, HIGH);
        readP1Hardwareserial();
        digitalWrite(LED_BUILTIN, LOW);
    }
}
